const List<String> residenceTypes = [
  '선택',
  '1인 가구',
  '2인 가구',
  '3인 가구',
  '4인 가구',
  '5인 가구',
  '6인 이상 가구',
];

const List<String> emailTypes = [
  '직접입력',
  'gmail.com',
  'naver.com',
  'daum.net',
  'kakao.com',
];

final bankAccountType = [
  '선택',
  '하나은행',
  'SC제일은행',
  '경남은행',
  '광주은행',
  '국민은행',
  '기업은행',
  '농협은행',
  '대구은행',
  '부산은행',
  '산업은행',
  '새마을금고',
  '수협은행',
  '신한은행',
  '신협중앙회',
  '시티은행',
  '우리은행',
  '우체국',
  '전북은행',
  '제주은행',
  '카카오뱅크',
  '케이뱅크',
  '토스뱅크',
];


const List<String> taskTpOptions = ['선택', '대표자', 'PM/PO', 'UX 리서처', '고객개발팀', '기타'];

const List<String> timeTypes = ['선택', '평일 오전', '평일 오후', '평일 저녁', '주말 오전', '주말 오후', '주말 저녁', '상관없음', '기타'];

 List<String> taskTypes = [
  "기획·전략",
  "마케팅·홍보·조사",
  "회계·세무·재무",
  "인사·노무·HRD",
  "총무·법무·사무",
  "IT개발·데이터",
  "디자인",
  "영업·판매·무역",
  "고객상담·TM",
  "구매·자재·물류",
  "상품기획·MD",
  "운전·운송·배송",
  "서비스",
  "생산",
  "건설·건축",
  "의료",
  "연구·R&D",
  "교육",
  "미디어·문화·스포츠",
  "금융·보험",
  "공공·복지",
  "선택안함"
];


const List<String> jobCdTypes = [
  '선택',
  '초등학생',
  '중학생',
  '고등학생',
  '대학생',
  '대학원생',
  '무직',
  '유학생',
  '직장인',
  '공무원',
  '사업자',
];

const List<String> petTypes = [
  '선택',
  '강아지',
  '고양이',
  '강아지+고양이',
  '없음',
];

const List<String> asignCdTypes = [
  '선택',
  '일반 사무직',
  '재무/경리',
  '영업직',
  '홍보 마케팅',
  '기획',
  '개발',
  '기타',
];



List<Map<String, dynamic>> industryInfos = [
  {
    "industry": "서비스업",
    "detailIndustry": [
      "호텔·여행·항공",
      "외식업·식음료",
      "시설관리·경비·용역",
      "레저·스포츠·여가",
      "AS·카센터·주유",
      "렌탈·임대",
      "웨딩·장례·이벤트",
      "뷰티·미용"
    ]
  },
  {
    "industry": "제조·화학",
    "detailIndustry": [
      "전기·전자·제어",
      "기계·설비·자동차",
      "석유·화학·에너지",
      "섬유·의류·패션",
      "화장품·뷰티",
      "생활용품·소비재·사무",
      "가구·목재·제지",
      "농업·어업·광업·임업",
      "금속·재료·철강·요업",
      "조선·항공·우주",
      "식품가공·개발",
      "반도체·광학·LCD",
      "환경"
    ]
  },
  {
    "industry": "IT·웹·통신",
    "detailIndustry": [
      "솔루션·SI·ERP·CRM",
      "웹에이젼시",
      "쇼핑몰·오픈마켓",
      "포털·인터넷·컨텐츠",
      "네트워크·통신·모바일",
      "하드웨어·장비",
      "정보보안·백신",
      "IT컨설팅"
    ]
  },
  {
    "industry": "은행·금융업",
    "detailIndustry": [
      "은행·금융·저축",
      "대출·캐피탈·여신",
      "증권·보험·카드"
    ]
  },
  {
    "industry": "미디어·디자인",
    "detailIndustry": [
      "신문·잡지·언론사",
      "방송사·케이블",
      "연예·엔터테인먼트",
      "광고·홍보·전시",
      "영화·배급·음악",
      "공연·예술·문화",
      "출판·인쇄·사진",
      "캐릭터·애니메이션",
      "디자인·설계"
    ]
  },
  {
    "industry": "교육업",
    "detailIndustry": [
      "초중고·대학",
      "학원·어학원",
      "유아·유치원",
      "교재·학습지",
      "전문·기능학원"
    ]
  },
  {
    "industry": "의료·제약·복지",
    "detailIndustry": [
      "의료(진료과목별)",
      "의료(병원종류별)",
      "제약·보건·바이오",
      "사회복지"
    ]
  },
  {
    "industry": "판매·유통",
    "detailIndustry": [
      "판매(매장종류별)",
      "판매(상품품목별)",
      "유통·무역·상사",
      "운송·운수·물류"
    ]
  },
  {
    "industry": "건설업",
    "detailIndustry": [
      "건설·건축·토목·시공",
      "실내·인테리어·조경",
      "환경·설비",
      "부동산·임대·중개"
    ]
  },
  {
    "industry": "기관·협회",
    "detailIndustry": [
      "정부·공공기관·공기업",
      "협회·단체",
      "법률·법무·특허",
      "세무·회계",
      "연구소·컨설팅·조사"
    ]
  },
  {
    "industry": "기타",
    "detailIndustry": [
      "기타"
    ]
  },
  {
    "industry": "없음",
    "detailIndustry": [
      "없음"
    ]
  }
];

List<Map<String, dynamic>> mapInfos = [
  {
    "name": "서울특별시",
    "countries": [
      "강남구",
      "강동구",
      "강북구",
      "강서구",
      "관악구",
      "광진구",
      "구로구",
      "금천구",
      "노원구",
      "도봉구",
      "동대문구",
      "동작구",
      "마포구",
      "서대문구",
      "서초구",
      "성동구",
      "성북구",
      "송파구",
      "양천구",
      "영등포구",
      "용산구",
      "은평구",
      "종로구",
      "중구",
      "중랑구"
    ]
  },
  {
    "name": "부산광역시",
    "countries": [
      "강서구",
      "금정구",
      "기장군",
      "남구",
      "동구",
      "동래구",
      "부산진구",
      "북구",
      "사상구",
      "사하구",
      "서구",
      "수영구",
      "연제구",
      "영도구",
      "중구",
      "해운대구"
    ]
  },
  {
    "name": "대구광역시",
    "countries": ["남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구"]
  },
  {
    "name": "인천광역시",
    "countries": [
      "강화군",
      "계양구",
      "남구",
      "남동구",
      "동구",
      "부평구",
      "서구",
      "연수구",
      "옹진군",
      "중구"
    ]
  },
  {
    "name": "광주광역시",
    "countries": ["광산구", "남구", "동구", "북구", "서구"]
  },
  {
    "name": "대전광역시",
    "countries": ["대덕구", "동구", "서구", "유성구", "중구"]
  },
  {
    "name": "울산광역시",
    "countries": ["남구", "동구", "북구", "울주군", "중구"]
  },
  {
    "name": "경기도",
    "countries": [
      "가평군",
      "고양시 덕양구",
      "고양시 일산동구",
      "고양시 일산서구",
      "과천시",
      "광명시",
      "광주시",
      "구리시",
      "군포시",
      "김포시",
      "남양주시",
      "동두천시",
      "부천시 소사구",
      "부천시 오정구",
      "부천시 원미구",
      "성남시 분당구",
      "성남시 수정구",
      "성남시 중원구",
      "수원시 권선구",
      "수원시 영통구",
      "수원시 장안구",
      "수원시 팔달구",
      "시흥시",
      "안산시 단원구",
      "안산시 상록구",
      "안성시",
      "안양시 동안구",
      "안양시 만안구",
      "양주시",
      "양평군",
      "여주군",
      "연천군",
      "오산시",
      "용인시 기흥구",
      "용인시 수지구",
      "용인시 처인구",
      "의왕시",
      "의정부시",
      "이천시",
      "파주시",
      "평택시",
      "포천시",
      "하남시",
      "화성시"
    ]
  },
  {
    "name": "강원도",
    "countries": [
      "강릉시",
      "고성군",
      "동해시",
      "삼척시",
      "속초시",
      "양구군",
      "양양군",
      "영월군",
      "원주시",
      "인제군",
      "정선군",
      "철원군",
      "춘천시",
      "태백시",
      "평창군",
      "홍천군",
      "화천군",
      "횡성군"
    ]
  },
  {
    "name": "충청북도",
    "countries": [
      "괴산군",
      "단양군",
      "보은군",
      "영동군",
      "옥천군",
      "음성군",
      "제천시",
      "증평군",
      "진천군",
      "청원군",
      "청주시 상당구",
      "청주시 흥덕구",
      "충주시"
    ]
  },
  {
    "name": "충청남도",
    "countries": [
      "계룡시",
      "공주시",
      "금산군",
      "논산시",
      "당진시",
      "보령시",
      "부여군",
      "서산시",
      "서천군",
      "아산시",
      "연기군",
      "예산군",
      "천안시 동남구",
      "천안시 서북구",
      "청양군",
      "태안군",
      "홍성군"
    ]
  },
  {
    "name": "전라북도",
    "countries": [
      "고창군",
      "군산시",
      "김제시",
      "남원시",
      "무주군",
      "부안군",
      "순창군",
      "완주군",
      "익산시",
      "임실군",
      "장수군",
      "전주시 덕진구",
      "전주시 완산구",
      "정읍시",
      "진안군"
    ]
  },
  {
    "name": "전라남도",
    "countries": [
      "강진군",
      "고흥군",
      "곡성군",
      "광양시",
      "구례군",
      "나주시",
      "담양군",
      "목포시",
      "무안군",
      "보성군",
      "순천시",
      "신안군",
      "여수시",
      "영광군",
      "영암군",
      "완도군",
      "장성군",
      "장흥군",
      "진도군",
      "함평군",
      "해남군",
      "화순군"
    ]
  },
  {
    "name": "경상북도",
    "countries": [
      "경산시",
      "경주시",
      "고령군",
      "구미시",
      "군위군",
      "김천시",
      "문경시",
      "봉화군",
      "상주시",
      "성주군",
      "안동시",
      "영덕군",
      "영양군",
      "영주시",
      "영천시",
      "예천군",
      "울릉군",
      "울진군",
      "의성군",
      "청도군",
      "청송군",
      "칠곡군",
      "포항시 남구",
      "포항시 북구"
    ]
  },
  {
    "name": "경상남도",
    "countries": [
      "거제시",
      "거창군",
      "고성군",
      "김해시",
      "남해군",
      "밀양시",
      "사천시",
      "산청군",
      "양산시",
      "의령군",
      "진주시",
      "창녕군",
      "창원시 마산합포구",
      "창원시 마산회원구",
      "창원시 성산구",
      "창원시 의창구",
      "창원시 진해구",
      "통영시",
      "하동군",
      "함안군",
      "함양군",
      "합천군"
    ]
  },
  {
    "name": "제주특별자치도",
    "countries": ["서귀포시", "제주시"]
  },
  {
    "name": "세종시",
    "countries": ["세종시"]
  },
];
